/*
 * Singleton:   применён в классе EyesColor и в классе Controller - почему запретить создание более одного экземпляра класса EyesColor и класса Controller, во избежании путаницы
 * Factory:     (не)применён - почему
 * Builder:     применён в классе Person - почему ублал мега конструктор, во избежании ошибок
 * Adapter:     (не)применён - почему
 * Bridge:      (не)применён - почему
 * Facade:      применён - в классе FioGenerator, почему сокращение кода, выводит ФИО одной командой
 * DTO:         (не)применён - почему
 * Шаблон:      применён - в абстрактоном классе Hair, для установки цвета волос, почему для использования одного метода для установки цвета волос и для длинных и для коротких волос, чуть подсократил код, абстракный класс в коде теперь не просто так
 */